In [1]:
import pandas as pd
import numpy as np

# Data Frame Creation

In [2]:
np.arange (0,20).reshape(5,4) # 5 = row ,,,, 4= columns

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [3]:
df=pd.DataFrame(data= np.arange(0,20).reshape(5,4),index =["row 1", "row 2","row 3","row 4","row 5"], 
                                                columns =["col 1", "col 2", "col 3", "col 4"] )
print(df)

       col 1  col 2  col 3  col 4
row 1      0      1      2      3
row 2      4      5      6      7
row 3      8      9     10     11
row 4     12     13     14     15
row 5     16     17     18     19

In [4]:
df.head(2) # to get top 2

       col 1  col 2  col 3  col 4
row 1      0      1      2      3
row 2      4      5      6      7

In [5]:
df.tail(3) # to get bottom 3

       col 1  col 2  col 3  col 4
row 3      8      9     10     11
row 4     12     13     14     15
row 5     16     17     18     19

In [6]:
df.info() # to get info of rows and columns

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, row 1 to row 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col 1   5 non-null      int32
 1   col 2   5 non-null      int32
 2   col 3   5 non-null      int32
 3   col 4   5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [7]:
df.describe() # to get count, mean, std, min, 25%, 50%, 75%, max

           col 1      col 2      col 3      col 4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

# Indexing has 2 types
1 by Columnname
2 by rowindex

In [8]:
df['col 1']

row 1     0
row 2     4
row 3     8
row 4    12
row 5    16
Name: col 1, dtype: int32

In [9]:
type(df['col 1']) # Single rows and col called series

pandas.core.series.Series

In [10]:
df[['col 1', 'col 2']] # particular for col

       col 1  col 2
row 1      0      1
row 2      4      5
row 3      8      9
row 4     12     13
row 5     16     17

In [11]:
type(df[['col 1', 'col 2']]) # multiple rows and multiple col called dataframe

pandas.core.frame.DataFrame

In [12]:
df.loc['row 1'] # to loc particular row

col 1    0
col 2    1
col 3    2
col 4    3
Name: row 1, dtype: int32

# use of .iloc

In [13]:
df.head()

       col 1  col 2  col 3  col 4
row 1      0      1      2      3
row 2      4      5      6      7
row 3      8      9     10     11
row 4     12     13     14     15
row 5     16     17     18     19

In [14]:
df.iloc[2:4,0:2] # use rows and col particular value

       col 1  col 2
row 3      8      9
row 4     12     13

In [15]:
df.iloc[:2,0:1]

       col 1
row 1      0
row 2      4

# Basic operation

In [16]:
df.isnull().sum # to check null value if have

<bound method NDFrame._add_numeric_operations.<locals>.sum of        col 1  col 2  col 3  col 4
row 1  False  False  False  False
row 2  False  False  False  False
row 3  False  False  False  False
row 4  False  False  False  False
row 5  False  False  False  False>

# Add null value

In [17]:
df= pd.DataFrame(data=[[1,np.nan,2],[1,3,4]],index=["row 1", "row 2"],columns=[["column 1", "column 2", "column 3"]])

In [18]:
df.head()

      column 1 column 2 column 3
row 1        1      NaN        2
row 2        1      3.0        4

In [19]:
df.count()

column 1    2
column 2    1
column 3    2
dtype: int64

In [20]:
df.shape

(2, 3)

In [21]:
df = pd.DataFrame(data= [[15,2,8],[4,5,8], [6,7,9], [7,9,10]], index= ["R 1", "R 2", "R3","R 4"], columns= [["C 1", "C 2", "C 3"]])

In [22]:
df

    C 1 C 2 C 3
R 1  15   2   8
R 2   4   5   8
R3    6   7   9
R 4   7   9  10

# To change values in the row or column
1) Using .iloc function

In [23]:
df.iloc[1,0]= 20

In [24]:
df

    C 1 C 2 C 3
R 1  15   2   8
R 2  20   5   8
R3    6   7   9
R 4   7   9  10

In [25]:
df.iloc[1,0]=4

In [26]:
df

    C 1 C 2 C 3
R 1  15   2   8
R 2   4   5   8
R3    6   7   9
R 4   7   9  10

# copy dataframe

In [27]:
new_df = df.copy()

In [28]:
new_df.iloc[1,0]= 100
new_df # here we can see that the value of this copied data has been changed but the real data set remain unchanged

     C 1 C 2 C 3
R 1   15   2   8
R 2  100   5   8
R3     6   7   9
R 4    7   9  10

In [29]:
df # This is the real data that is unchanged

    C 1 C 2 C 3
R 1  15   2   8
R 2   4   5   8
R3    6   7   9
R 4   7   9  10

# size shows no of values in the dataframe

In [30]:
df.size

12

# .ndim = shows data frame Dimension
1) if OUtput comes 1, then df is one dimension.
2) if Output comes 2, thens df is two dimension.

In [31]:
df.ndim

2

In [32]:
df.axes

[Index(['R 1', 'R 2', 'R3', 'R 4'], dtype='object'),
 MultiIndex([('C 1',),
             ('C 2',),
             ('C 3',)],
            )]

# .pop = to drop/remove items from datafrane

In [33]:
new_df = df.copy()
new_df.pop('C 1')

    C 1
R 1  15
R 2   4
R3    6
R 4   7

In [34]:
new_df

    C 2 C 3
R 1   2   8
R 2   5   8
R3    7   9
R 4   9  10

In [35]:
df

    C 1 C 2 C 3
R 1  15   2   8
R 2   4   5   8
R3    6   7   9
R 4   7   9  10

In [36]:
new_df

    C 2 C 3
R 1   2   8
R 2   5   8
R3    7   9
R 4   9  10

In [37]:
df

    C 1 C 2 C 3
R 1  15   2   8
R 2   4   5   8
R3    6   7   9
R 4   7   9  10

In [38]:
df.at([0], ['label']) 'col 1'

SyntaxError: invalid syntax (3298190184.py, line 1)

# To get the detail of columns

In [39]:
df.columns

MultiIndex([('C 1',),
            ('C 2',),
            ('C 3',)],
           )

In [40]:
df.index

Index(['R 1', 'R 2', 'R3', 'R 4'], dtype='object')

In [41]:
df.count()

C 1    4
C 2    4
C 3    4
dtype: int64

In [42]:
df.sum()

C 1    32
C 2    23
C 3    35
dtype: int64

In [43]:
new_df

    C 2 C 3
R 1   2   8
R 2   5   8
R3    7   9
R 4   9  10